In [2]:
import mysql.connector as pycon
import numpy as np
import pandas as pd

In [3]:
dbcon=pycon.connect(user='root', password='ilovemymom@555', host='127.0.0.1', database='ineuron')

In [4]:
db1=pd.read_sql_query("""select first_name from worker where first_name not in("shail","anu")""",dbcon)
db1

  first_name
0    Shaheen
1       Amit
2      Srini
3      Rakhi
4    Somrita
5      Rehan
6    Amitabh
7     Shadab
8      Saroj

In [5]:
# Write an SQL query to print details of the Workers whose FIRST_NAME ends with ‘h’ and contains six alphabets.
db2=pd.read_sql_query("""select * from worker where first_name like '%______h' """,dbcon)
db2

   Wor_id First_name Last_name  Salary           Join_date   Depart
0       9    Amitabh   Bacchan   30000 2017-04-23 10:02:55  Account